"""Модуль, который описывает исключения для классов Driver и Car"""

class DriverTypeError(Exception):
    """Класс исключения, которое возникает, если тип значения не является классом Driver"""
    pass


class EngineIsNotRunning(Exception):
    """Класс исключения, которое возникает, если двигатель экземляра класса Car находится в нерабочем состоянии"""
    pass


class AlarmOn(Exception):
    """Класс исключения, которое возникает, если срабатывает сигнализация экземпляра класса Car"""
    pass


class DriverNotFoundError(Exception):
    """Класс исключения, которое возникает, если отсутствует экземпляр класса Driver"""
    pass


class MoveStop(Exception):
    """Класс исключения, которое возникает, если экземпляр класса Car не может продолжать движение"""
    pass


class TechnicInspection(Exception):
    """Класс исключения, которое возникает, если экземпляром класса Car вовремя не пройдено ТО"""
    pass


class GasTankEmpty(Exception):
    """Класс исключения, которое возникает, если у экземпляра класса Car отсутствует топливо"""
    pass


class InvalidLicense(Exception):
    """Класс исключения, которое возникает у экземпляра класса Driver если введены данные недействующих прав"""
    pass
